[
  {
    "name": "Castillo de San Marcos",
    "description": "The oldest masonry fort in the continental United States",
    "latitude": 29.8981,
    "longitude": -81.3124,
    "riddle": "Built of coquina stone, I've stood for centuries long. Spanish soldiers once manned my walls so strong. What am I?",
    "answer": "castillo",
    "tokenReward": 25,
    "triggerRadius": 50,
    "category": "historical",
    "iconType": "fort",
    "historicalInfo": "Built by the Spanish in 1672, this fort has never been taken by force. It's made from coquina, a unique stone composed of ancient shells.",
    "isActive": true
  },
  {
    "name": "St. George Street",
    "description": "Historic pedestrian street with shops and restaurants",
    "latitude": 29.8947,
    "longitude": -81.3124,
    "riddle": "Named for a saint and a dragon slayer, I'm the heart of old town where travelers and traders came. Walk my cobblestones to find your way. What street am I?",
    "answer": "st george",
    "tokenReward": 10,
    "triggerRadius": 50,
    "category": "landmark",
    "iconType": "ship",
    "historicalInfo": "St. George Street has been a commercial hub since the 1700s. Today it's a vibrant pedestrian street filled with historic buildings, shops, and restaurants.",
    "isActive": true
  },
  {
    "name": "Lightner Museum",
    "description": "Museum housed in the former Alcazar Hotel",
    "latitude": 29.8919,
    "longitude": -81.3133,
    "riddle": "Once a grand hotel where the wealthy would stay, now a museum displaying treasures from yesterday. What building am I?",
    "answer": "lightner",
    "tokenReward": 15,
    "triggerRadius": 50,
    "category": "landmark",
    "iconType": "default",
    "historicalInfo": "Built by Henry Flagler in 1888 as the Alcazar Hotel, it featured one of the world's largest indoor swimming pools. Now it houses Otto Lightner's collection of Gilded Age artifacts.",
    "isActive": true
  },
  {
    "name": "Pirate & Treasure Museum",
    "description": "Home to the world's largest collection of authentic pirate artifacts",
    "latitude": 29.8960,
    "longitude": -81.3126,
    "riddle": "Yo ho ho and a bottle of rum! Here treasure and pirates are never glum. Blackbeard's flag and Drake's drum. Where am I from?",
    "answer": "pirate museum",
    "tokenReward": 20,
    "triggerRadius": 50,
    "category": "attraction",
    "iconType": "skull",
    "historicalInfo": "This museum features one of only two authentic Jolly Roger flags in existence, along with a treasure chest from Captain Thomas Tew's ship.",
    "isActive": true
  },
  {
    "name": "Bridge of Lions",
    "description": "Iconic drawbridge with marble lion statues",
    "latitude": 29.8934,
    "longitude": -81.3089,
    "riddle": "I span the water with pride and grace, two marble beasts guard my place. What bridge am I?",
    "answer": "bridge of lions",
    "tokenReward": 10,
    "triggerRadius": 50,
    "category": "landmark",
    "iconType": "lion",
    "historicalInfo": "Opened in 1927, this bridge is guarded by two marble lion statues inspired by the Medici lions in Florence, Italy.",
    "isActive": true
  },
  {
    "name": "Old City Gates",
    "description": "Historic entrance to the colonial city",
    "latitude": 29.8975,
    "longitude": -81.3140,
    "riddle": "I once protected the city from foes, through me soldiers and merchants would go. The old city's entrance, as history shows. What am I?",
    "answer": "city gates",
    "tokenReward": 10,
    "triggerRadius": 50,
    "category": "historical",
    "iconType": "gate",
    "historicalInfo": "These gates and earthen walls were built in 1739 to protect St. Augustine from British attack. They mark the northern entrance to the colonial quarter.",
    "isActive": true
  },
  {
    "name": "Fountain of Youth",
    "description": "Archaeological park at the site of Ponce de Leon's landing",
    "latitude": 29.9012,
    "longitude": -81.3107,
    "riddle": "Ponce de León sought me with great zeal, hoping eternal youth I would reveal. What legendary spring am I?",
    "answer": "fountain of youth",
    "tokenReward": 20,
    "triggerRadius": 50,
    "category": "attraction",
    "iconType": "fountain",
    "historicalInfo": "Though legend says Ponce de León searched for it, this archaeological park marks the site where Spanish explorers first landed in Florida in 1513.",
    "isActive": true
  },
  {
    "name": "Colonial Quarter",
    "description": "Living history museum of colonial St. Augustine",
    "latitude": 29.8956,
    "longitude": -81.3132,
    "riddle": "Step back in time to see how they lived, in houses and shops that history has given. Where colonial life is preserved and relived. What place am I?",
    "answer": "colonial quarter",
    "tokenReward": 15,
    "triggerRadius": 50,
    "category": "historical",
    "iconType": "house",
    "historicalInfo": "This living history museum features reconstructed buildings from different periods of St. Augustine's colonial past, with costumed guides demonstrating 17th and 18th-century life.",
    "isActive": true
  },
  {
    "name": "St. Augustine Lighthouse",
    "description": "Historic lighthouse and maritime museum",
    "latitude": 29.8807,
    "longitude": -81.2886,
    "riddle": "Black and white spirals reach to the sky, guiding ships safely as they sail by. 165 feet tall, oh my! What am I?",
    "answer": "lighthouse",
    "tokenReward": 25,
    "triggerRadius": 50,
    "category": "landmark",
    "iconType": "lighthouse",
    "historicalInfo": "Built in 1874, this 165-foot lighthouse is said to be haunted. Climb 219 steps to the top for breathtaking views of the Ancient City.",
    "isActive": true
  },
  {
    "name": "Cathedral Basilica",
    "description": "Oldest Catholic church in Florida",
    "latitude": 29.8941,
    "longitude": -81.3131,
    "riddle": "My bells have rung for centuries past, the oldest parish, standing fast. Where faithful gather for Sunday mass. What church am I?",
    "answer": "cathedral",
    "tokenReward": 15,
    "triggerRadius": 50,
    "category": "historical",
    "iconType": "church",
    "historicalInfo": "Founded in 1565, this is the first parish in the United States. The current building dates to 1797 and was designated a basilica in 1976.",
    "isActive": true
  }
]

